rocm10_check/logs/glm5_atom_rocm101/run.log
[09:24:45] === GLM-5 on ATOM ROCm10, TP8, --level 3 --cudagraph-mode FULL --kv_cache_dtype fp8 ===
[09:24:45] waiting for server (up to 40 min)
[09:31:33] server READY after 410s
[09:31:33] === benchmark: 8192x1024 conc=8 prompts=24 ===
Warming up with 1 requests...
100%|██████████| 1/1 [00:08<00:00,  8.22s/it]
Warmup completed.
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
100%|██████████| 24/24 [00:41<00:00,  1.74s/it]
Starting main benchmark run...
============ Serving Benchmark Result ============
Successful requests:                     24        
Benchmark duration (s):                  41.76     
Total input tokens:                      106585    
Total generated tokens:                  10433     
Request throughput (req/s):              0.57      
Output token throughput (tok/s):         249.85    
Total Token throughput (tok/s):          2802.30   
Concurrency:                             6.50      
---------------Time to First Token----------------
Mean TTFT (ms):                          843.00    
Median TTFT (ms):                        474.94    
P99 TTFT (ms):                           2359.77   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          24.74     
Median TPOT (ms):                        24.27     
P99 TPOT (ms):                           34.17     
---------------Inter-token Latency----------------
Mean ITL (ms):                           24.08     
Median ITL (ms):                         20.99     
P99 ITL (ms):                            183.95    
==================================================
[09:32:27] === result ===
  completed        = 24
  total throughput = 2802.30 tok/s over TP8
  tok/s/GPU        = 350.29
[09:32:28] === DONE ===